-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2023-03-18 08:50:24
-- 伺服器版本： 10.4.22-MariaDB
-- PHP 版本： 8.0.25

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `53web03`
--

-- --------------------------------------------------------

--
-- 資料表結構 `product`
--

CREATE TABLE `product` (
  `id` int(11) NOT NULL,
  `name` varchar(30) DEFAULT NULL,
  `udesc` varchar(255) DEFAULT NULL,
  `price` int(30) DEFAULT NULL,
  `link` varchar(255) DEFAULT NULL,
  `image` text DEFAULT NULL,
  `date` date DEFAULT NULL,
  `isShow` tinyint(1) NOT NULL DEFAULT 1,
  `isTop` tinyint(1) NOT NULL,
  `template_id` int(30) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `product`
--

INSERT INTO `product` (`id`, `name`, `udesc`, `price`, `link`, `image`, `date`, `isShow`, `isTop`, `template_id`) VALUES
(2, 'e', 'd', 0, 'd', 'img/20230318075514.jpg', '2023-03-17', 1, 0, 3),
(3, 'test2', 'test', 12390, 'link:phpssobyths', 'img/20230318073121.jpg', '2023-03-18', 1, 0, 18);

-- --------------------------------------------------------

--
-- 資料表結構 `record`
--

CREATE TABLE `record` (
  `id` int(11) NOT NULL,
  `account` varchar(303) NOT NULL,
  `time` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `action` varchar(30) NOT NULL,
  `utype` varchar(30) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `record`
--

INSERT INTO `record` (`id`, `account`, `time`, `action`, `utype`) VALUES
(1, 'admin', '2023-02-24 09:27:24', '登出', '成功'),
(3, 'admin', '2023-02-24 09:31:38', '登入', '成功'),
(4, 'admin', '2023-02-24 09:31:43', '登出', '成功'),
(5, 'admin', '2023-02-24 09:31:49', '登入', '成功'),
(6, 'admin', '2023-03-02 05:13:16', '登出', '成功'),
(7, 'admin', '2023-03-02 05:13:19', '登入', '成功'),
(8, 'admin', '2023-03-02 08:18:26', '登入', '成功'),
(9, 'admin', '2023-03-03 01:23:40', '登入', '成功'),
(10, 'admin', '2023-03-03 01:29:29', '登出', '成功'),
(11, 'admin', '2023-03-03 01:29:31', '登入', '成功'),
(12, 'admin', '2023-03-03 07:09:45', '登出', '成功'),
(13, 'admin', '2023-03-03 07:21:45', '登入', '成功'),
(14, 'admin', '2023-03-03 07:22:10', '登入', '成功'),
(15, 'admin', '2023-03-03 07:27:31', '登入', '成功'),
(16, 'admin', '2023-03-03 07:29:07', '登出', '成功'),
(17, 'admin', '2023-03-03 07:33:50', '登入', '成功'),
(18, 'admin', '2023-03-04 02:12:54', '登入', '成功'),
(19, 'admin', '2023-03-04 08:33:54', '登出', '成功'),
(20, 'admin', '2023-03-04 08:49:53', '登入', '成功'),
(21, 'admin', '2023-03-04 08:49:56', '登出', '成功'),
(22, 'admin', '2023-03-04 08:50:42', '登入', '成功'),
(23, 'admin', '2023-03-04 08:54:27', '登出', '成功'),
(24, 'admin', '2023-03-06 00:40:42', '登入', '成功'),
(25, 'admin', '2023-03-06 00:51:59', '登出', '成功'),
(26, 'admin', '2023-03-06 00:54:57', '登入', '成功'),
(27, 'admin', '2023-03-06 02:07:47', '登入', '成功'),
(28, 'admin', '2023-03-06 02:15:56', '登入', '成功'),
(29, 'admin', '2023-03-06 02:16:21', '登入', '失敗'),
(30, 'admin', '2023-03-06 02:16:28', '登入', '失敗'),
(31, 'admin', '2023-03-06 02:17:08', '登入', '失敗'),
(32, 'admin', '2023-03-06 02:17:20', '登出', '成功'),
(33, 'admin', '2023-03-06 02:17:26', '登入', '失敗'),
(34, 'admin', '2023-03-06 02:17:30', '登入', '失敗'),
(35, 'admin', '2023-03-06 02:18:10', '登入', '失敗'),
(36, 'admin', '2023-03-06 02:18:24', '登入', '失敗'),
(37, 'admin', '2023-03-06 02:18:46', '登入', '失敗'),
(38, 'admin', '2023-03-06 02:19:15', '登入', '失敗'),
(39, 'admin', '2023-03-06 02:21:21', '登入', '成功'),
(40, 'admin', '2023-03-06 02:22:19', '登入', '成功'),
(41, 'admin', '2023-03-06 02:22:29', '登入', '成功'),
(42, 'admin', '2023-03-06 02:23:06', '登入', '失敗'),
(43, 'admin', '2023-03-06 02:23:10', '登入', '失敗'),
(44, 'admin', '2023-03-06 02:23:12', '登出', '成功'),
(45, 'admin', '2023-03-06 02:23:15', '登入', '失敗'),
(46, 'admin', '2023-03-06 02:23:16', '登入', '失敗'),
(47, 'admin', '2023-03-06 02:23:18', '登入', '失敗'),
(48, 'admin', '2023-03-06 02:24:26', '登入', '失敗'),
(49, 'admin', '2023-03-06 02:24:43', '登入', '失敗'),
(50, 'admin', '2023-03-06 02:24:50', '登入', '失敗'),
(51, 'admin', '2023-03-06 02:24:51', '登入', '失敗'),
(52, 'admin', '2023-03-06 02:25:08', '登入', '失敗'),
(53, 'admin', '2023-03-06 02:25:10', '登入', '失敗'),
(54, 'admin', '2023-03-06 02:25:57', '登入', '失敗'),
(55, 'admin', '2023-03-06 02:26:00', '登入', '失敗'),
(56, 'admin', '2023-03-06 02:26:02', '登入', '失敗'),
(57, 'admin', '2023-03-06 02:26:04', '登入', '失敗'),
(58, 'admin', '2023-03-06 02:26:12', '登入', '成功'),
(59, 'admin', '2023-03-06 03:00:58', '登出', '成功'),
(60, 'admin', '2023-03-06 03:01:07', '登入', '成功'),
(61, 'admin', '2023-03-06 09:42:28', '登出', '成功'),
(62, 'admin', '2023-03-06 09:42:35', '登入', '成功'),
(63, 'admin', '2023-03-06 10:53:43', '登出', '成功'),
(64, 'admin', '2023-03-06 10:58:56', '登入', '成功'),
(65, 'admin', '2023-03-06 11:08:31', '登出', '成功'),
(66, 'admin', '2023-03-06 11:11:50', '登入', '成功'),
(67, 'admin', '2023-03-06 11:13:18', '登入', '成功'),
(68, 'admin', '2023-03-06 11:13:26', '登入', '成功'),
(69, 'admin', '2023-03-06 11:14:10', '登入', '成功'),
(70, 'admin', '2023-03-06 11:46:45', '登入', '失敗'),
(71, 'admin', '2023-03-06 11:46:48', '登出', '成功'),
(72, 'admin', '2023-03-06 11:47:18', '登入', '失敗'),
(73, 'admin', '2023-03-06 11:47:29', '登入', '失敗'),
(74, 'admin', '2023-03-06 11:49:10', '登入', '失敗'),
(75, 'admin', '2023-03-06 11:53:20', '登入', '失敗'),
(76, 'admin', '2023-03-06 11:53:57', '登入', '失敗'),
(77, 'admin', '2023-03-06 11:54:19', '登入', '失敗'),
(78, 'admin', '2023-03-06 11:54:33', '登入', '成功'),
(79, 'admin', '2023-03-06 11:54:38', '登出', '成功'),
(80, 'admin', '2023-03-06 12:08:06', '登入', '成功'),
(81, 'admin', '2023-03-06 12:10:28', '登出', '成功'),
(82, 'admin', '2023-03-06 12:13:09', '登入', '失敗'),
(83, 'admin', '2023-03-06 12:13:20', '登入', '成功'),
(84, 'admin', '2023-03-06 12:16:58', '登出', '成功'),
(85, 'admin', '2023-03-06 12:18:51', '登入', '成功'),
(86, 'admin', '2023-03-06 12:44:43', '登出', '成功'),
(87, 'admin', '2023-03-06 12:44:56', '登入', '成功'),
(88, 'admin', '2023-03-06 12:46:52', '登出', '成功'),
(89, 'admin', '2023-03-06 12:53:29', '登入', '成功'),
(90, 'admin', '2023-03-06 12:53:43', '登入', '失敗'),
(91, 'admin', '2023-03-06 12:53:52', '登出', '成功'),
(92, 'admin', '2023-03-07 00:14:27', '登入', '失敗'),
(93, 'admin', '2023-03-07 00:14:34', '登入', '成功'),
(94, 'admin', '2023-03-07 00:25:55', '登出', '成功'),
(95, 'admin', '2023-03-07 00:51:45', '登入', '成功'),
(96, 'admin', '2023-03-07 00:56:21', '登出', '成功'),
(97, 'admin2', '2023-03-07 00:56:52', '登入', '成功'),
(98, 'admin', '2023-03-07 00:57:50', '登入', '成功'),
(99, 'admin', '2023-03-07 00:57:55', '登出', '成功'),
(100, 'admin2', '2023-03-07 00:58:03', '登入', '成功'),
(101, 'admin2', '2023-03-07 00:58:22', '登入', '成功'),
(102, 'admin2', '2023-03-07 01:00:56', '登出', '成功'),
(103, 'admin', '2023-03-07 01:01:04', '登入', '成功'),
(104, 'admin', '2023-03-07 01:04:29', '登出', '成功'),
(105, 'admin', '2023-03-07 01:04:53', '登入', '成功'),
(106, 'admin', '2023-03-07 01:07:28', '登出', '成功'),
(107, 'admin', '2023-03-07 01:07:35', '登入', '成功'),
(108, 'admin', '2023-03-07 01:09:33', '登出', '成功'),
(109, 'admin', '2023-03-07 01:10:57', '登入', '成功'),
(110, 'admin', '2023-03-07 01:53:07', '登出', '成功'),
(111, 'admin', '2023-03-07 01:53:25', '登入', '成功'),
(112, 'admin', '2023-03-07 02:22:48', '登出', '成功'),
(113, 'admin', '2023-03-07 02:58:50', '登入', '失敗'),
(114, 'admin', '2023-03-07 02:59:04', '登入', '失敗'),
(115, 'admin', '2023-03-07 02:59:20', '登入', '失敗'),
(116, 'admin', '2023-03-07 02:59:58', '登入', '成功'),
(117, 'admin', '2023-03-07 03:15:11', '登出', '成功'),
(118, 'admin', '2023-03-07 03:15:44', '登入', '成功'),
(119, 'admin', '2023-03-07 03:15:46', '登出', '成功'),
(120, 'admin', '2023-03-07 03:16:13', '登入', '成功'),
(121, 'admin', '2023-03-07 03:16:15', '登出', '成功'),
(122, 'admin', '2023-03-07 03:16:27', '登入', '成功'),
(123, 'admin', '2023-03-07 03:16:55', '登出', '成功'),
(124, 'admin', '2023-03-07 03:17:04', '登入', '成功'),
(125, 'admin', '2023-03-07 03:17:10', '登出', '成功'),
(126, 'admin', '2023-03-07 03:17:49', '登入', '成功'),
(127, 'admin', '2023-03-07 03:17:59', '登出', '成功'),
(128, 'admin', '2023-03-07 03:20:18', '登入', '成功'),
(129, 'admin', '2023-03-07 03:22:34', '登出', '成功'),
(130, 'admin', '2023-03-07 03:22:44', '登入', '失敗'),
(131, 'admin', '2023-03-07 03:23:17', '登入', '失敗'),
(132, 'admin', '2023-03-07 03:25:18', '登入', '失敗'),
(133, 'admin', '2023-03-07 03:25:25', '登入', '失敗'),
(134, 'admin', '2023-03-07 03:26:26', '登入', '失敗'),
(135, 'admin', '2023-03-07 03:26:35', '登入', '失敗'),
(136, 'admin', '2023-03-07 03:27:06', '登入', '成功'),
(137, 'admin', '2023-03-07 03:43:22', '登入', '成功'),
(138, 'admin', '2023-03-10 02:50:34', '登出', '成功'),
(139, 'admin', '2023-03-10 02:51:04', '登入', '成功'),
(140, 'admin', '2023-03-10 03:02:43', '登出', '成功'),
(141, 'admin', '2023-03-10 03:03:45', '登入', '成功'),
(142, 'admin', '2023-03-16 01:44:34', '登入', '失敗'),
(143, 'admin', '2023-03-16 01:44:46', '登入', '失敗'),
(144, 'admin', '2023-03-16 01:45:05', '登入', '成功'),
(145, 'admin', '2023-03-16 02:17:34', '登入', '成功'),
(146, 'admin', '2023-03-16 02:17:56', '登入', '失敗'),
(147, 'admin', '2023-03-16 02:18:37', '登入', '成功'),
(148, 'admin', '2023-03-16 02:18:45', '登入', '成功'),
(149, 'admin', '2023-03-16 06:40:27', '登入', '成功'),
(150, 'admin', '2023-03-16 06:40:41', '登入', '失敗');

-- --------------------------------------------------------

--
-- 資料表結構 `template`
--

CREATE TABLE `template` (
  `id` int(11) NOT NULL,
  `layout` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `template`
--

INSERT INTO `template` (`id`, `layout`) VALUES
(3, '[\"date\",\"name\",\"link\",\"price\",\"udesc\",\"image\"]'),
(13, '[\"link\",\"name\",\"date\",\"price\",\"image\",\"udesc\"]'),
(14, '[\"link\",\"udesc\",\"image\",\"price\",\"name\",\"date\"]'),
(18, '[\"date\",\"name\",\"link\",\"image\",\"udesc\",\"price\"]'),
(19, '[\"image\",\"name\",\"date\",\"price\",\"udesc\",\"link\"]');

-- --------------------------------------------------------

--
-- 資料表結構 `timecount`
--

CREATE TABLE `timecount` (
  `id` int(11) NOT NULL,
  `time` int(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `timecount`
--

INSERT INTO `timecount` (`id`, `time`) VALUES
(1, 90);

-- --------------------------------------------------------

--
-- 資料表結構 `users`
--

CREATE TABLE `users` (
  `id` int(4) UNSIGNED ZEROFILL NOT NULL,
  `name` varchar(30) NOT NULL,
  `account` varchar(30) NOT NULL,
  `password` varchar(30) NOT NULL,
  `role` varchar(30) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `users`
--

INSERT INTO `users` (`id`, `name`, `account`, `password`, `role`) VALUES
(0000, '超級管理員', 'admin', '1234', '管理員'),
(0004, '1234', 'admin2', '12345', '會員'),
(0005, '人員2', 'admin', '1234', '會員'),
(0007, 'sssss', 'admin3', 'ss', '管理員');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `product`
--
ALTER TABLE `product`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `record`
--
ALTER TABLE `record`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `template`
--
ALTER TABLE `template`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `timecount`
--
ALTER TABLE `timecount`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `product`
--
ALTER TABLE `product`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `record`
--
ALTER TABLE `record`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=151;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `template`
--
ALTER TABLE `template`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=20;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `timecount`
--
ALTER TABLE `timecount`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `users`
--
ALTER TABLE `users`
  MODIFY `id` int(4) UNSIGNED ZEROFILL NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
